JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_uart.c
/**
 * @file cw32l012_uart.c
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2024-08-07
 *
 * @copyright Copyright (c) 2022
 *
 */
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "cw32l012_uart.h"

/* Private_TypesDefinitions --------------------------------------------------*/

/* Private_Defines -----------------------------------------------------------*/

/* Private_Variables ---------------------------------------------------------*/
volatile boolean_t txComplete = TRUE;
volatile boolean_t rxComplete = TRUE;
volatile uint8_t *rxDataPtr;
volatile uint8_t *txDataPtr;
volatile uint32_t rxDataLen;
volatile uint32_t txDataLen;
/* Private_FunctionPrototypes ------------------------------------------------*/

/* Private_Functions ---------------------------------------------------------*/

/* Public_Functions ----------------------------------------------------------*/

/**
 * @brief 通过UARTx发送一个数据(8bit/9bit)
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param Data :待发送的数据
 */
void UART_SendData(UART_TypeDef* UARTx, uint16_t Data)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));    

    UARTx->TDR = Data;
}

/**
 * @brief 发送字符串
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、、
 * @param String :待发送的字符串
 */
void UART_SendString(UART_TypeDef* UARTx, char* String)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    
    while (*String != '\0')
    {
        UARTx->TDR = *String;        
        while (!UARTx->ISR_f.TXE);
        String++;
    }
    while (UARTx->ISR_f.TXBUSY);
}

/**
 * @brief 通过UARTx接收一个数据(8bit/9bit)
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @return uint16_t :接收的数据
 */
uint16_t UART_ReceiveData(UART_TypeDef* UARTx)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    return UARTx->RDR;
}

/**
 * @brief 接收一组数据
 *
 * @param UARTx :UARTx外设
 *        参数可以是: CW_UART1、CW_UART2、
 * @param String :接收的字符串
 * @param length :接收字符串的长度
 */
UART_StatusTypeDef UART_TransmitPolling(UART_TypeDef* UARTx, uint8_t *Data, uint32_t length)
{
    UART_StatusTypeDef status = UART_STATUS_OK;
    // 检查传入的UART外设参数是否合法
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    // 检查传入的数据指针是否为空
    if (Data == NULL)
    {
        return UART_STATUS_ERROR; 
    }

    if (UARTx->ISR_f.TXBUSY)
    {
        return UART_STATUS_BUSY;
    }
    
    UARTx->CR1_f.TXEN = 1;
    while (length > 0)
    {
        UARTx->TDR = *Data;
        while (!UARTx->ISR_f.TXE);
        Data++;
        length--;
    }
    while (UARTx->ISR_f.TXBUSY);
    UARTx->CR1_f.TXEN = 0;
    return status;
}

UART_StatusTypeDef UART_ReceivePolling(UART_TypeDef* UARTx, uint8_t *Data, uint32_t length)
{
    UART_StatusTypeDef status = UART_STATUS_OK;
    // 检查传入的UART外设参数是否合法
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    // 检查传入的数据指针是否为空
    if (Data == NULL)
    {
        return UART_STATUS_ERROR;
    }
    
    UARTx->ICR_f.RC = 0;
    UARTx->CR1_f.RXEN = 1;
    while (length > 0)
    {
        while (!UARTx->ISR_f.RC);        
        *Data = UARTx->RDR;
        Data++;
        length--;
        UARTx->ICR_f.RC = 0;
    }
    UARTx->CR1_f.RXEN = 0;
    return status;
}

/**
 * @brief 通过UARTx以中断方式发送数据
 * 
 * @param UARTx : UARTx外设，参数可以是 CW_UART1、CW_UART2、CW_UART3 等
 * @param Data : 待发送数据的指针
 * @param length : 待发送数据的个数
 * @note  中断服务函数中需要完成数据的再次发送和标志位的清除
 */
UART_StatusTypeDef UART_TransmitInterrupt(UART_TypeDef* UARTx, uint8_t *Data, uint32_t length)
{
    UART_StatusTypeDef status = UART_STATUS_OK;
    // 检查传入的UART外设参数是否合法
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    
    // 检查传入的数据指针是否为空
    if (Data == NULL)
    {
        return UART_STATUS_ERROR;
    }

    if (UARTx->ISR_f.TXBUSY)
    {
        return UART_STATUS_BUSY;
    }

    if (txComplete == FALSE)
    {
        return UART_STATUS_BUSY;
    }
    txDataPtr = Data;
    txDataLen = length;
    txComplete = FALSE;
    UARTx->ICR_f.TC = 1;    
    UARTx->IER_f.TC = 1;
    UARTx->CR1_f.TXEN = 1;
    UARTx->TDR = *txDataPtr;
    txDataLen--;
    return status;
}

/**
 * @brief 通过UARTx以中断方式接收数据
 *
 * @param UARTx : UARTx外设，参数可以是 CW_UART1、CW_UART2、CW_UART3 等
 * @param Data : 待接收数据的指针
 * @param length : 待接收数据的个数
 * @note  中断服务函数中需要完成数据的接收和标志位的清除
 */
UART_StatusTypeDef UART_ReceiveInterrupt(UART_TypeDef* UARTx, uint8_t *Data, uint32_t length)
{
    UART_StatusTypeDef status = UART_STATUS_OK;
    // 检查传入的UART外设参数是否合法
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    // 检查传入的数据指针是否为空
    if (Data == NULL)
    {
        return UART_STATUS_ERROR; 
    } 

    if (rxComplete == FALSE)
    {
        return UART_STATUS_BUSY;
    }
    if (length  == 0)
    {
        return UART_STATUS_ERROR;
    }
    rxDataPtr = Data;
    rxDataLen = length;
    rxComplete = FALSE;
    UARTx->ICR_f.RC = 1;
    UARTx->IER_f.RC = 1;
    UARTx->CR1_f.RXEN = 1;
    return status;
} 

/**
 * @brief 通过UARTx以DMA方式发送数据
 *
 * @param UARTx : UARTx外设，参数可以是 CW_UART1、CW_UART2、CW_UART3 等
 * @param DMACHx : DMA通道，参数可以是 DMA_CHANNEL_1、DMA_CHANNEL_2、DMA_CHANNEL_3、DMA_CHANNEL_4 等
 * @param Data : 待发送数据的指针
 * @param length : 待发送数据的个数
 */
UART_StatusTypeDef UART_TransmitDMA(UART_TypeDef* UARTx, DMA_ChannelTypeDef DMACHx, uint8_t *Data, uint32_t length)
{
    UART_StatusTypeDef status = UART_STATUS_OK;
    // 检查传入的UART外设参数是否合法
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    // 检查传入的数据指针是否为空
    if (Data == NULL)
    {
        return UART_STATUS_ERROR;
    }

    if (UARTx->ISR_f.TXBUSY)         // 检查UART是否忙
    {
        return UART_STATUS_BUSY;
    }

