JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_uart.c
    CW_SYSCTRL->AHBEN |= 0x5a5a0000 | SYSCTRL_AHBEN_DMA_Msk;    // 使能DMA时钟
    CW_SYSCTRL->AHBRST_f.DMA = 0;                             // 复位DMA
    CW_SYSCTRL->AHBRST_f.DMA = 1;                             // 使能DMA

    *DMA_CNTy(DMACHx) = length | 1 << DMA_CNT1_REPEAT_Pos ;          // 设置DMA传输的数据长度
    *DMA_SRCADDRy(DMACHx) = (uint32_t)Data;                    // 设置DMA源地址
    *DMA_DSTADDRy(DMACHx) = (uint32_t)&UARTx->TDR;             // 设置DMA目的地址

    switch ((uint32_t)UARTx)
    {
        case (uint32_t)CW_UART1:
            *DMA_TRIGy(DMACHx) = DMA_TRIGGER_SRC_UART1_TX << DMACHx_TRIG_HARDSRC_Pos | DMA_TRIGGER_HARDWARE << DMACHx_TRIG_TYPE_Pos;             // 设置DMA触发源
            break;
        case (uint32_t)CW_UART2:
            *DMA_TRIGy(DMACHx) = DMA_TRIGGER_SRC_UART2_TX << DMACHx_TRIG_HARDSRC_Pos | DMA_TRIGGER_HARDWARE << DMACHx_TRIG_TYPE_Pos;             // 设置DMA触发源
            break;
        case (uint32_t)CW_UART3:
            *DMA_TRIGy(DMACHx) = DMA_TRIGGER_SRC_UART3_TX << DMACHx_TRIG_HARDSRC_Pos | DMA_TRIGGER_HARDWARE << DMACHx_TRIG_TYPE_Pos;             // 设置DMA触发源
            break;
    }
    *DMA_CSRy(DMACHx) = DISABLE << DMACHx_CSR_DSTLOAD_Pos | DISABLE << DMACHx_CSR_SRCLOAD_Pos |\
                        DISABLE << DMACHx_CSR_RESTART_Pos | DMA_DATA_SIZE_8BITS << DMACHx_CSR_SIZE_Pos |\
                        DMA_ADDRESS_FIXED << DMACHx_CSR_DSTINC_Pos | DMA_ADDRESS_INCREMENT << DMACHx_CSR_SRCINC_Pos |\
                        DMA_MODE_BLOCK << DMACHx_CSR_TRANS_Pos | ENABLE << DMACHx_CSR_EN_Pos; // 配置DMA通道

    UARTx->CR1_f.TXEN = 1;            // 使能UART发送
    //UARTx->CR2_f.DMATX = 1;         // 使能UART DMA发送
    return status;
}

/**
 * @brief 通过UARTx以DMA方式接收数据
 *
 * @param UARTx : UARTx外设，参数可以是 CW_UART1、CW_UART2、CW_UART3 等
 * @param DMACHx : DMA通道，参数可以是 DMA_CHANNEL_1、DMA_CHANNEL_2、DMA_CHANNEL_3、DMA_CHANNEL_4 等
 * @param Data : 待接收数据的指针
 * @param length : 待接收数据的个数
 */
UART_StatusTypeDef UART_ReceiveDMA(UART_TypeDef* UARTx, DMA_ChannelTypeDef DMACHx, uint8_t *Data, uint32_t length)
{
    UART_StatusTypeDef status = UART_STATUS_OK;
    // 检查传入的UART外设参数是否合法
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    // 检查传入的数据指针是否为空
    if (Data == NULL)
    {
        return UART_STATUS_ERROR;
    }    

    CW_SYSCTRL->AHBEN |= 0x5a5a0000 | SYSCTRL_AHBEN_DMA_Msk;    // 使能DMA时钟
    CW_SYSCTRL->AHBRST_f.DMA = 0;                             // 复位DMA
    CW_SYSCTRL->AHBRST_f.DMA = 1;                             // 使能DMA
    *DMA_CNTy(DMACHx) = length | 1 << DMA_CNT1_REPEAT_Pos ;          // 设置DMA传输的数据长度
    *DMA_SRCADDRy(DMACHx) = (uint32_t)&UARTx->RDR;                    // 设置DMA源地址
    *DMA_DSTADDRy(DMACHx) = (uint32_t)Data;             // 设置DMA目的地址

    switch ((uint32_t)UARTx)
    {
        case (uint32_t)CW_UART1:
            *DMA_TRIGy(DMACHx) = DMA_TRIGGER_SRC_UART1_RX << DMACHx_TRIG_HARDSRC_Pos | DMA_TRIGGER_HARDWARE << DMACHx_TRIG_TYPE_Pos;             // 设置DMA触发源
            break;
        case (uint32_t)CW_UART2:
            *DMA_TRIGy(DMACHx) = DMA_TRIGGER_SRC_UART2_RX << DMACHx_TRIG_HARDSRC_Pos | DMA_TRIGGER_HARDWARE << DMACHx_TRIG_TYPE_Pos;             // 设置DMA触发源
            break;
        case (uint32_t)CW_UART3:
            *DMA_TRIGy(DMACHx) = DMA_TRIGGER_SRC_UART3_RX << DMACHx_TRIG_HARDSRC_Pos | DMA_TRIGGER_HARDWARE << DMACHx_TRIG_TYPE_Pos;             // 设置DMA触发源
            break;             
    }
    *DMA_CSRy(DMACHx) = DISABLE << DMACHx_CSR_DSTLOAD_Pos | DISABLE << DMACHx_CSR_SRCLOAD_Pos |\
                        DISABLE << DMACHx_CSR_RESTART_Pos | DMA_DATA_SIZE_8BITS << DMACHx_CSR_SIZE_Pos |\
                        DMA_ADDRESS_INCREMENT << DMACHx_CSR_DSTINC_Pos | DMA_ADDRESS_FIXED << DMACHx_CSR_SRCINC_Pos |\
                        DMA_MODE_BLOCK << DMACHx_CSR_TRANS_Pos | ENABLE << DMACHx_CSR_EN_Pos; // 配置DMA通道

    UARTx->CR1_f.RXEN = 1;            // 使能UART接收
    //UARTx->CR2_f.DMARX = 1;         // 使能UART DMA接收
    return status;
}


/**
 * @brief 在同步模式下通过UARTx发送数据(8bit)
 * @param UARTx :UARTx外设
 * @param Data :待发送的数据的指针
 * @param length :待发送的数据的个数
 */
void UART_SyncMode_SendDataPolling(UART_TypeDef* UARTx, uint8_t *Data, uint32_t length)
{
    uint8_t *ptr = Data;
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    UARTx->ICR = 0;

    UARTx->CR1_f.TXEN = 1;

    while (length)
    {        
        UARTx->TDR_f.TDR = *ptr;
        ptr++;
        length--;
        while (UARTx->ISR_f.TXE == 0);
    }
    while (UARTx->ISR_f.TXBUSY == 1);
    UARTx->CR1_f.TXEN = 0;
}

/**
 * @brief 在同步模式下通过UARTx接收数据(8bit)
 * @param UARTx :UARTx外设
 * @param Data :待接收的数据缓存的指针
 * @param length :待接收的数据的个数
 * @return uint8_t :接收的数据
 */
void UART_SyncMode_ReceiveDataPolling(UART_TypeDef* UARTx, uint8_t *Data, uint32_t length)
{
    uint8_t *ptr = Data;
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    UARTx->ICR_f.RC = 0;

    UARTx->CR1_f.RXEN = 1;

    while (length)
    {
        while (UARTx->ISR_f.RC == 0);
        *ptr = UARTx->RDR;
        ptr++;
        length--;
        UARTx->ICR_f.RC = 0;
    }
    UARTx->CR1_f.RXEN = 0;
}


/**
 * @brief 根据UART_InitStruct中指定的参数初始化UARTx外设
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param UART_InitStruct :指向UART_InitTypeDef类型结构体的指针
 */
void UART_Init(UART_TypeDef* UARTx, UART_InitTypeDef* UART_InitStruct)
{
    uint16_t integerdivider = 0x00;
    uint16_t fractionaldivider = 0x00;
    float32_t temp = 0;

    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_BAUDRATE(UART_InitStruct->UART_BaudRate));
    assert_param(IS_UART_Over(UART_InitStruct->UART_Over));
    assert_param(IS_UART_Source(UART_InitStruct->UART_Source));
    assert_param(IS_UART_UCLKFREQ(UART_InitStruct->UART_UclkFreq));
    assert_param(IS_UART_StartBit(UART_InitStruct->UART_StartBit));
    assert_param(IS_UART_STOPBITS(UART_InitStruct->UART_StopBits));
    assert_param(IS_UART_PARITY(UART_InitStruct->UART_Parity));
    assert_param(IS_UART_MODE(UART_InitStruct->UART_Mode));
    assert_param(IS_UART_HARDWARE_FLOW_CONTROL(UART_InitStruct->UART_HardwareFlowControl));

    switch ((uint32_t)UARTx)
    {
    case (uint32_t)CW_UART1:
        CW_SYSCTRL->APBEN1 = (CW_SYSCTRL->APBEN1 & 0x0000FFFF) | 0x5a5a0000 | SYSCTRL_APBEN1_UART1_Msk;
        break;
    case (uint32_t)CW_UART2:
        CW_SYSCTRL->APBEN1 = (CW_SYSCTRL->APBEN1 & 0x0000FFFF) | 0x5a5a0000 | SYSCTRL_APBEN1_UART2_Msk;
        break;
    case (uint32_t)CW_UART3:
        CW_SYSCTRL->APBEN1 = (CW_SYSCTRL->APBEN1 & 0x0000FFFF) | 0x5a5a0000 | SYSCTRL_APBEN1_UART3_Msk;
        break;
    default:
        break;
    }

    /* UARTx_CR1 */
    REGBITS_MODIFY(UARTx->CR1, UARTx_CR1_SOURCE_Msk | UARTx_CR1_OVER_Msk | UARTx_CR1_START_Msk | \
                   UARTx_CR1_STOP_Msk | UARTx_CR1_PARITY_Msk | \
                   UARTx_CR1_RXEN_Msk | UARTx_CR1_TXEN_Msk    \
                   , \
                   UART_InitStruct->UART_Source | \
                   (uint32_t)UART_InitStruct->UART_Over | \
                   UART_InitStruct->UART_StartBit       | \
                   UART_InitStruct->UART_StopBits       | \
                   UART_InitStruct->UART_Parity         | \
                   UART_InitStruct->UART_Mode);

    /* UARTx_CR2 */
    REGBITS_MODIFY(UARTx->CR2,  UARTx_CR2_RTSEN_Msk | \
                   UARTx_CR2_CTSEN_Msk  \
                   , \
                   UART_InitStruct->UART_HardwareFlowControl);
    /* 校验位 */
    if (UART_InitStruct->UART_Parity != UART_Parity_No)
    {
        UARTx->CR1_f.CHLEN = 1;
    }
    else
    {
        UARTx->CR1_f.CHLEN = 0;
    }

    /* 波特率设置 */
    if (UART_Over_16 == UART_InitStruct->UART_Over)
    {
        /* 16倍采样 */
        temp = (float32_t)(UART_InitStruct->UART_UclkFreq) / (16 * (UART_InitStruct->UART_BaudRate));
        integerdivider = (uint16_t)temp;
        fractionaldivider = (uint16_t)((temp - integerdivider) * 16 + 0.5);
        UARTx->BRRI = (uint16_t)integerdivider;
        UARTx->BRRF = (uint16_t)fractionaldivider;
    }
    else if (UART_Over_8 == UART_InitStruct->UART_Over)
    {
        /* 8倍采样 */
        integerdivider = (uint16_t)((float32_t)(UART_InitStruct->UART_UclkFreq) / (8 * (UART_InitStruct->UART_BaudRate)) + 0.5);
        UARTx->BRRI = (uint16_t)integerdivider;
    }
    else if (UART_Over_4 == UART_InitStruct->UART_Over)
    {
        /* 4倍采样 */
        integerdivider = (uint16_t)((float32_t)(UART_InitStruct->UART_UclkFreq) / (4 * (UART_InitStruct->UART_BaudRate)) + 0.5);
        UARTx->BRRI = (uint16_t)integerdivider;
    }
    else
    {
        /* 专用采样 */
        /* 专用采样仅适合传输时钟源为LSE或者LSI时，进行2400bps、4800bps或9600bps波特率下的UART通信 */
        integerdivider = (uint16_t)((float32_t)(UART_InitStruct->UART_UclkFreq) * 256 / (UART_InitStruct->UART_BaudRate) + 0.5);
        UARTx->BRRI = (uint16_t)integerdivider;
    }
}

/**
 * @brief 默认值赋值UART_InitStruct结构体成员
 *
 * @param UART_InitStruct :指向UART_InitTypeDef类型结构体的指针
 */
void UART_StructInit(UART_InitTypeDef* UART_InitStruct)
{
    /* UART_InitStruct members default value */
    UART_InitStruct->UART_BaudRate = 9600;
    UART_InitStruct->UART_Over = UART_Over_16;
    UART_InitStruct->UART_Source = UART_Source_PCLK;
    UART_InitStruct->UART_StartBit = UART_StartBit_FE;
    UART_InitStruct->UART_StopBits = UART_StopBits_1;
    UART_InitStruct->UART_Parity = UART_Parity_No ;
    UART_InitStruct->UART_Mode = UART_Mode_Rx | UART_Mode_Tx;
    UART_InitStruct->UART_HardwareFlowControl = UART_HardwareFlowControl_None;
}

/**
 * @brief UARTx同步模式初始化，CPOL=1、CPHA=1，只能做主机
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param UART_ClockInitStruct :指向UART_ClockInitTypeDef类型结构体的指针
 */
void UART_ClockInit(UART_TypeDef* UARTx, UART_ClockInitTypeDef* UART_ClockInitStruct)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_CLOCK(UART_ClockInitStruct->UART_Clock));
    assert_param(IS_UART_Source(UART_ClockInitStruct->UART_Source));

    REGBITS_MODIFY(UARTx->CR1, UARTx_CR1_SYNC_Msk | UARTx_CR1_SOURCE_Msk, \
                   (uint32_t)UART_ClockInitStruct->UART_Clock | \
                   (uint32_t)UART_ClockInitStruct->UART_Source);
}

/**
 * @brief 默认值赋值UART_ClockInitStruct结构体成员
 *
 * @param UART_ClockInitStruct :指向UART_ClockInitTypeDef类型结构体的指针
 */
void UART_ClockStructInit(UART_ClockInitTypeDef* UART_ClockInitStruct)
{
    /* UART_ClockInitStruct members default value */
    UART_ClockInitStruct->UART_Clock = UART_Clock_Disable;
    UART_ClockInitStruct->UART_Source = UART_Source_PCLK;
}

/**
 * @brief UARTx同步模式初始化，CPOL=1、CPHA=1，只能做主机
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @param UART_SyncModeInitStruct :指向UART_SyncModeInitTypeDef类型结构体的指针
 */
void UART_SyncMode_Init(UART_TypeDef* UARTx, UART_SyncModeInitTypeDef *UART_SyncModeInitStruct)
{
    uint32_t BRRI;

    if (UART_SyncModeInitStruct->UART_BaudRate == 0)
    {
        return;
    }
    BRRI = UART_SyncModeInitStruct->UART_ClockFreq / (UART_SyncModeInitStruct->UART_BaudRate << 1);
    if (BRRI > 0xFF)
    {
        BRRI = 0xFF;    // 低8位有效
    }
    // 打开UART时钟
    switch ((uint32_t)UARTx)
    {
    case (uint32_t)CW_UART1:
        CW_SYSCTRL->APBEN1 = (CW_SYSCTRL->APBEN1 & 0x0000FFFF) | 0x5a5a0000 | SYSCTRL_APBEN1_UART1_Msk;
        break;
    case (uint32_t)CW_UART2:
        CW_SYSCTRL->APBEN1 = (CW_SYSCTRL->APBEN1 & 0x0000FFFF) | 0x5a5a0000 | SYSCTRL_APBEN1_UART2_Msk;
        break;
    case (uint32_t)CW_UART3:
        CW_SYSCTRL->APBEN1 = (CW_SYSCTRL->APBEN1 & 0x0000FFFF) | 0x5a5a0000 | SYSCTRL_APBEN1_UART3_Msk;
        break;
    default:
        break;
    }

    //
    UARTx->CR1 = UARTx_CR1_SYNC_Msk | \
                 UART_SyncModeInitStruct->UART_ClockSource | \
                 UART_SyncModeInitStruct->UART_TransmitOrder;
    UARTx->CR2_f.ADDREN = 0;
    UARTx->BRRI = BRRI;
}


/**
 * @brief UART1去初始化
 *
 */
void UART1_DeInit(void)
{
    CW_SYSCTRL->APBRST1_f.UART1 = 0;
    CW_SYSCTRL->APBRST1_f.UART1 = 1;
}

/**
 * @brief UART2去初始化
 *
 */
void UART2_DeInit(void)
{
    CW_SYSCTRL->APBRST1_f.UART2 = 0;
    CW_SYSCTRL->APBRST1_f.UART2 = 1;
}

/**
 * @brief UART2去初始化
 *
 */
void UART3_DeInit(void)
{
    CW_SYSCTRL->APBRST1_f.UART3 = 0;
    CW_SYSCTRL->APBRST1_f.UART3 = 1;
}


/**
 * @brief 使能/失能UARTx中断
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param UART_IT :中断源
 *   参数可以是:
 *     @arg UART_IT_RXMATCH:  接收匹配中断
 *     @arg UART_IT_ORE:     溢出错误中断
 *     @arg UART_IT_NE:      噪声错误中断
 *     @arg UART_IT_PE:    奇偶校验错误中断
 *     @arg UART_IT_FE:    帧结构错误中断
 *     @arg UART_IT_CTS:   CTS信号变化中断
 *     @arg UART_IT_TIMOV: 定时器溢出中断
 *     @arg UART_IT_BAUD:  自动波特率检测完成中断
 *     @arg UART_IT_RXBRK: 间隔段接收完成中断
 *     @arg UART_IT_RXIDLE: 接收空闲中断
 *     @arg UART_IT_RC:    接收完成中断
 *     @arg UART_IT_TC:    发送完成中断
 *     @arg UART_IT_TXE:   发送缓冲空中断
 * @param NewState :ENABLE or DISABLE
 */
void UART_ITConfig(UART_TypeDef* UARTx, uint16_t UART_IT, FunctionalState NewState)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_IT(UART_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    NewState ? (UARTx->IER |= UART_IT) : (UARTx->IER &= (uint16_t)~UART_IT);

