JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_uart.c
    REGBITS_SET(UARTx->CR2, UARTx_CR2_ADDREN_Msk);
    REGBITS_MODIFY(UARTx->ADDR, UARTx_ADDR_ADDR_Msk, (uint32_t)UART_Address);
    REGBITS_MODIFY(UARTx->MASK, UARTx_MASK_MASK_Msk, (uint32_t)UART_AddressMsK);
}

/**
 * @brief 使能/失能LIN模式
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param NewState :ENABLE or DISABLE
 */
void UART_LINCmd(UART_TypeDef* UARTx, FunctionalState NewState)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    UARTx->CR3_f.LIN = NewState;
    UARTx->CR1_f.SIGNAL = 0;
    UARTx->CR1_f.SYNC = 0;
    UARTx->CR1_f.STOP = 0;
    UARTx->CR1_f.PARITY = 0;
}

/**
 * @brief 发送LIN中断
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @param BreakLength :间隔段长度 一般大于13bit
 */ 
void UART_LINSendBreak(UART_TypeDef* UARTx, UART_LINBreakSendLengthTypeDef BreakLength)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    UARTx->TDR = BreakLength;   
}
/**
 * @brief 设置LIN模式接收间隔段的长度阈值
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param UART_LINBreakDetectLength :间隔段长度阈值
  *   参数可以是：
 *     @arg UART_LIN_BREAK_DETECT_LENGTH_10B: 10bit
 *     @arg UART_LIN_BREAK_DETECT_LENGTH_11B: 11bit
 */
void UART_LINBreakDetectLengthConfig(UART_TypeDef* UARTx, UART_LINBreakDetectLengthTypeDef UART_LINBreakDetectLength)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));    

    UARTx->CR3_f.BRKL = UART_LINBreakDetectLength;
}

/**
 * @brief 定时器工作模式配置
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param UART_TimerMode :定时器工作模式
  *   参数可以是：
 *     @arg UART_TimerMode_Stop:          停止定时器
 *     @arg UART_TimerMode_TimeOut:       等待超时检测模式
 *     @arg UART_TimerMode_Idle:          接收空闲检测模式
 *     @arg UART_TimerMode_AutoBaudRate1: 自动波特率侦测模式1
 *     @arg UART_TimerMode_AutoBaudRate2: 自动波特率侦测模式2
 *     @arg UART_TimerMode_GeneralTimer:  通用定时功能
 */
void UART_TimerModeConfig(UART_TypeDef* UARTx, uint16_t UART_TimerMode)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_TIMER_MODE(UART_TimerMode));

    REGBITS_MODIFY(UARTx->CR2, UARTx_CR2_TIMCR_Msk, (uint32_t)UART_TimerMode);
}

/**
 * @brief 设置定时器重载值
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @param Autoreload :定时器重载值 范围0x000000~0xFFFFFF
 */
void UART_SetAutoReload(UART_TypeDef* UARTx, uint32_t AutoReload)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_UART_AUTORELOAD(AutoReload));

    UARTx->TIMARR = AutoReload;
}

/**
 * @brief 获取定时器当前计数值
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、
 * @return uint32_t :定时器当前计数值
 */
uint32_t UART_GetCounter(UART_TypeDef* UARTx)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    return UARTx->TIMCNT;
}


/**
 * @brief 交换UARTx引脚功能
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @param NewState : 使能或禁用引脚交换，ENABLE 表示启用交换，DISABLE 表示恢复默认
 */
void UART_PinSwapCmd(UART_TypeDef* UARTx, FunctionalState NewState)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    // 根据不同的UART外设，配置对应的引脚交换
    UARTx->CR2_f.SWAP = NewState;
}

/**
 * @brief 启用自动波特率检测
 * 
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @param AutoBaudRateMode : 自动波特率检测模式，UART_AutoBaudRateModeTypeDef 类型的枚举值
 * @note
 *    - 确保在调用此函数之前已经配置了 UART 模块的时钟源
 *    - 此函数会启用自动波特率检测功能，并根据指定的模式进行配置
 *    - 自动波特率检测模式包括：
 *        - UART_AUTO_BAUD_RATE_MODE_1: RXD下降沿使定时器启动从0开始计数，上升沿停止定时器；计数时钟为UCLK；检测完成自动停止
 *        - UART_AUTO_BAUD_RATE_MODE_2: RXD下降沿使定时器启动从0开始计数，第4个下升沿停止定时器；计数时钟为UCLK；检测完成自动停止
 */
void UART_EnableAutoBaudRateDetection(UART_TypeDef* UARTx,UART_AutoBaudRateModeTypeDef AutoBaudRateMode)
 {
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    UARTx->ICR_f.BAUD = 0; // 清除自动波特率检测完成标志
    UARTx->TIMARR = 0xFFFFFF; // 设置定时器重载值为最大值，确保定时器不会溢出

    if (AutoBaudRateMode == UART_AUTO_BAUD_RATE_MODE_1) 
    {        
        // 配置定时器工作模式为 UART_AUTO_BAUD_RATE_MODE_1
        UART_TimerModeConfig(UARTx, UART_TimerMode_AutoBaudRate1);
    }
    else if (AutoBaudRateMode == UART_AUTO_BAUD_RATE_MODE_2)
    {
        // 配置定时器工作模式为 UART_AUTO_BAUD_RATE_MODE_2
        UART_TimerModeConfig(UARTx, UART_TimerMode_AutoBaudRate2);
    }
}

/**
 * @brief 禁用自动波特率检测
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @note
 *    - 此函数会停止自动波特率检测功能，并禁用定时器
 */
void UART_DisableAutoBaudRateDetection(UART_TypeDef* UARTx)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    UARTx->ICR_f.BAUD = 0; // 清除自动波特率检测完成标志
    UART_TimerModeConfig(UARTx, UART_TimerMode_Stop); // 停止定时器
}


// 检查自动波特率检测是否完成
boolean_t UART_AutoBaudRateDetectionComplete(UART_TypeDef* UARTx) 
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    
    return (boolean_t)UARTx->ISR_f.BAUD; // 检查自动波特率检测完成标志
}

// 获取检测到的波特率
uint32_t UART_GetDetectedBaudRate(UART_TypeDef* UARTx) 
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    return UARTx->TIMCNT;
}

/**
 * @brief 使能UARTx数据匹配
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @note
 *    - 此函数会使能UARTx的数据匹配功能
 */ 
void  UART_EnableDataMatch(UART_TypeDef* UARTx)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    UARTx->CR2_f.RXMATCHEN = 1;
}

/**
 * @brief 禁用UARTx数据匹配
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @note
 *    - 此函数会禁用UARTx的数据匹配功能
 */
void  UART_DisableDataMatch(UART_TypeDef* UARTx)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));

    UARTx->CR2_f.RXMATCHEN = 0;
}

/**
 * @brief 设置UARTx数据匹配值
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @param DataMatch : 数据匹配值，范围为0x000~0x1FF
 * @note DataMach的最高位为奇偶校验位
 */
void  UART_SetDataMatch(UART_TypeDef* UARTx, uint16_t DataMatch)
{
   assert_param(IS_UART_ALL_PERIPH(UARTx));
   
   UARTx->RXMATCH = DataMatch;
}

/**
 * @brief 获取UARTx数据匹配标志
 *
 * @param UARTx :UARTx外设
 *        参数可以是:
 *           CW_UART1、CW_UART2、CW_UART3
 * @return boolean_t : 数据匹配标志，TRUE 表示数据匹配，FALSE 表示数据不匹配
 */
boolean_t UART_GetDataMatchFlag(UART_TypeDef* UARTx)
{
    assert_param(IS_UART_ALL_PERIPH(UARTx));
    return (boolean_t)UARTx->ISR_f.RXMATCH;
}



